# -*- coding:utf-8 -*- 
'''
Created on 2017��7��2��
@author: lijj
'''

list1=[1,2,6,3,10,4,69,21,41,12,6,9,16]
list2=[1,2,6,3,10,4,69,21,41,12,6,9,16]
list3=[1,2,6,3,10,4,69,21,41,12,6,9,16]
list4=[1,2,6,3,10,4,69,21,41,12,6,9,16]
#list.sort()
list1.sort(key=None, reverse=False)
print(list1)
'''[1, 2, 3, 4, 6, 6, 9, 10, 12, 16, 21, 41, 69]'''
list2.sort()
print(list2)
'''[1, 2, 3, 4, 6, 6, 9, 10, 12, 16, 21, 41, 69]
 '''
#倒叙排列
list3.reverse()
print(list3)
'''[16, 9, 6, 12, 41, 21, 69, 4, 10, 3, 6, 2, 1]
'''
#排序后再倒叙
list4.sort(reverse=True)
print(list4)
'''[69, 41, 21, 16, 12, 10, 9, 6, 6, 4, 3, 2, 1]
'''